#Дана строка, состоящая из слов, разделенных пробелами.
#Определите, сколько в ней слов.
#Используйте для решения задачи функцию `count()`
print(input("Введите строку:").count(' ') + 1)
