#Написать программу, которая выводит на экран таблицу Esc-посл.
print('\\a    Bell(alert)')
print('\\b    Backspace')
print('\\n    new line')
print('\\t    Horizontal tab')
print('\\\\   Back slash \\')
print('\\"    Double quatation mark \"')
print('\\\'    Single quatation mark \'')
